In [1]:
import numpy as np
import pandas as pd

# Built-in

In [2]:
dataset = [
    {'foo': 1, 'bar': 4, 'name': 'bob'},
    {'foo': 3, 'bar': 3, 'name': 'joe'},
    {'foo': 4, 'bar': 1, 'name': 'smith'}
]

In [3]:
sorted(dataset, key=lambda x: x['foo'])

[{'foo': 1, 'bar': 4, 'name': 'bob'},
 {'foo': 3, 'bar': 3, 'name': 'joe'},
 {'foo': 4, 'bar': 1, 'name': 'smith'}]

In [4]:
sorted(dataset, key=lambda x: x['bar'])

[{'foo': 4, 'bar': 1, 'name': 'smith'},
 {'foo': 3, 'bar': 3, 'name': 'joe'},
 {'foo': 1, 'bar': 4, 'name': 'bob'}]

In [5]:
sorted(dataset, key=lambda x: x['foo'] + x['bar'])

[{'foo': 1, 'bar': 4, 'name': 'bob'},
 {'foo': 4, 'bar': 1, 'name': 'smith'},
 {'foo': 3, 'bar': 3, 'name': 'joe'}]

In [6]:
def rank(x):
    return x['foo'] + x['bar']

In [7]:
sorted(dataset, key=lambda x: rank(x))

[{'foo': 1, 'bar': 4, 'name': 'bob'},
 {'foo': 4, 'bar': 1, 'name': 'smith'},
 {'foo': 3, 'bar': 3, 'name': 'joe'}]

# Pandas

In [8]:
dataset = [
    {'foo': 1, 'bar': 4, 'name': 'bob'},
    {'foo': 3, 'bar': 3, 'name': 'joe'},
    {'foo': 4, 'bar': 1, 'name': 'smith'}
]

In [9]:
df = pd.DataFrame(dataset)

In [10]:
df.sort_values(['foo'])

   foo  bar   name
0    1    4    bob
1    3    3    joe
2    4    1  smith

In [11]:
df.sort_values(['bar'])

   foo  bar   name
2    4    1  smith
1    3    3    joe
0    1    4    bob

In [12]:
#can't do this because each col will be sorted independently
#df.sort_values(by=['foo', 'bar'], ascending=[True, True], key=lambda x: x)

In [13]:
df['rank'] = df['foo'] + df['bar']

In [14]:
df.sort_values('rank')

   foo  bar   name  rank
0    1    4    bob     5
2    4    1  smith     5
1    3    3    joe     6

In [15]:
weights = {'foo': 0.5, 'bar': 1.25}
df['rank_weighted'] = df['foo'] * weights['foo'] + df['bar'] * weights['bar']
df.sort_values('rank_weighted')

   foo  bar   name  rank  rank_weighted
2    4    1  smith     5           3.25
1    3    3    joe     6           5.25
0    1    4    bob     5           5.50

In [16]:
df['rank_weighted'] = df['foo'] / df['bar']
df.sort_values('rank_weighted')

   foo  bar   name  rank  rank_weighted
0    1    4    bob     5           0.25
1    3    3    joe     6           1.00
2    4    1  smith     5           4.00

In [17]:
from sklearn.preprocessing import MinMaxScaler

In [18]:
df_fancy = df.copy().drop(columns=['rank_weighted', 'rank'])

In [19]:
for col in ['foo', 'bar']:
    df_fancy[col] = MinMaxScaler().fit_transform(df[[col]])

In [20]:
df_fancy

        foo       bar   name
0  0.000000  1.000000    bob
1  0.666667  0.666667    joe
2  1.000000  0.000000  smith

In [21]:
df_fancy['rank'] = df_fancy['foo'] + df_fancy['bar']

In [24]:
df_fancy.sort_values('rank', ascending=False)

        foo       bar   name      rank
1  0.666667  0.666667    joe  1.333333
0  0.000000  1.000000    bob  1.000000
2  1.000000  0.000000  smith  1.000000